INSERT INTO Types (TypeName) VALUES
    ('Питание'),
    ('Патроны'),
    ('Гранаты'),
    ('Шлема'),
    ('Бронежилеты');

INSERT INTO Supply (TypeID, SupName, SupDescription, StockQuantity, SupWeight) VALUES
    (1, 'ИРП', 'Суточный рацион на одного бойца', 1000, 1),
    (2, '7,62х49', 'Патрон промежуточный автоматный', 234, 1),
    (3, 'РГД-1', 'Ручная противопехотная граната', 502, 2),
    (4, 'ЗШ21', 'Шлем противоосколочный', 101, 4),
    (5, 'БР21', 'Лёгкий бронежилет', 58, 20);

INSERT INTO Soldier (Fio, PasswordHash, SquadID,  Rank, BirthDate) VALUES
    ('abc2', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 1, 2, '2004-01-01'),
    ('abc1', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 1, 1, '2004-01-01'),
    ('abc0', 'a665a45920422f9d417e4867efdc4fb8a04a1f3fff1fa07e998e86f7f7a27ae3', 1, 0, '2004-01-01'),
    ('Иванов Иван Иванович', 'hash1', 1, 2, '2004-01-01'),
    ('Иванов Василий Иванович', 'hash1', 1, 2, '2002-01-01'),
    ('Иванов Владимир Иванович', 'hash1', 2, 2, '2001-01-01'),    
    ('Иванов Сидор Иванович', 'hash1', 3, 2, '2000-01-01'),
    ('Сидоров Иван Сидорович', 'hash2', 1, 1, '2001-02-01'),  
    ('Сидоров Пётр Сидорович', 'hash2', 2, 1, '2002-02-01'),
    ('Сидоров Виктор Сидорович', 'hash2', 3, 1, '2003-02-01'),
    ('Сидоров Никита Сидорович', 'hash2', 3, 1, '2004-02-01'),
    ('Петров Пётр Петрович', 'hash3', 1, 0, '2004-03-01');

INSERT INTO Request (SoldierID, ReqDate, ReqStatus, TotalWeight) VALUES
    (1, '2024-11-01', 'Обрабатывается', 15),
    (2, '2024-11-02', 'Одобрен', 20),
    (1, '2024-11-03', 'Отклонён', 5);

INSERT INTO ReqDet (SupplyID, ReqID, Amount) VALUES
    (1, 1, 5),
    (3, 1, 5),
    (5, 2, 1),
    (1, 3, 5);

INSERT INTO Squad (SquadComanderID) VALUES
    (2),
    (6),
    (6),
    (3);

INSERT INTO Reserve (SoldierID, SupplyID, Amount) VALUES
    (1, 1, 1),
    (2, 2, 2),
    (2, 5, 1);

